================================================================================
Basic expressions
================================================================================

a + b * c - d;

---

(program
  (expression_statement
    (binary_operator
      left: (binary_operator
        left: (identifier)
        right: (binary_operator
          left: (identifier)
          right: (identifier)))
      right: (identifier))))

================================================================================
Parenthesized expression
================================================================================

_2a + (b * (c - d)) / e;

---

(program
  (expression_statement
    (binary_operator
      left: (identifier)
      right: (binary_operator
        left: (parenthesized_expression
          (binary_operator
            left: (identifier)
            right: (parenthesized_expression
              (binary_operator
                left: (identifier)
                right: (identifier)))))
        right: (identifier)))))

================================================================================
Unary minus
================================================================================

a + -b;

---

(program
  (expression_statement
    (binary_operator
      left: (identifier)
      right: (unary_operator
        right: (identifier)))))

================================================================================
Integers
================================================================================

0x1 + 0xa\
    ff;

---

(program
  (expression_statement
    (binary_operator
      left: (integer)
      right: (integer))))

================================================================================
Reals
================================================================================

1.0;
12345e-4;
1.2345p10;
12345e-4p8;
1p2;
1e+3;
---
(program
  (expression_statement
    (real))
  (expression_statement
    (real))
  (expression_statement
    (real))
  (expression_statement
    (real))
  (expression_statement
    (real))
  (expression_statement
    (real)))
