================================================================================
Basic expressions
================================================================================

a + b * c - d;

---

(program
  (expression_statement
    (binary_operator
      left: (binary_operator
        left: (identifier)
        right: (binary_operator
          left: (identifier)
          right: (identifier)))
      right: (identifier))))

================================================================================
Unary minus
================================================================================

a + -b;

---

(program
  (expression_statement
    (binary_operator
      left: (identifier)
      right: (unary_operator
        right: (identifier)))))

================================================================================
Integers
================================================================================

1 + 3;

---

(program
  (expression_statement
    (binary_operator
      left: (integer)
      right: (integer))))

================================================================================
Reals TODO: implement scanner for '1.2e4'
================================================================================

1.0;

---
(program
  (expression_statement
    (real)))
